cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32TG11B340F64IQ48.svd
        <register>
          <name>LFEPRESC0</name>
          <description>Low Frequency E Prescaler Register 0 (Async Reg)</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RTCC</name>
              <description>Real-Time Counter and Calendar Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>LFECLKRTCC = LFECLK</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>LFECLKRTCC = LFECLK/2</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>LFECLKRTCC = LFECLK/4</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F050055</resetMask>
          <fields>
            <field>
              <name>LFACLKEN0</name>
              <description>Low Frequency a Clock Enable 0 Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFAPRESC0</name>
              <description>Low Frequency a Prescaler 0 Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFBCLKEN0</name>
              <description>Low Frequency B Clock Enable 0 Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFBPRESC0</name>
              <description>Low Frequency B Prescaler 0 Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFECLKEN0</name>
              <description>Low Frequency E Clock Enable 0 Busy</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFEPRESC0</name>
              <description>Low Frequency E Prescaler 0 Busy</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HFRCOBSY</name>
              <description>HFRCO Busy</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUXHFRCOBSY</name>
              <description>AUXHFRCO Busy</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFRCOBSY</name>
              <description>LFRCO Busy</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFRCOVREFBSY</name>
              <description>LFRCO VREF Busy</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HFXOBSY</name>
              <description>HFXO Busy</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFXOBSY</name>
              <description>LFXO Busy</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREEZE</name>
          <description>Freeze Register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>REGFREEZE</name>
              <description>Register Update Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNTCTRL</name>
          <description>PCNT Control Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>PCNT0CLKEN</name>
              <description>PCNT0 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0CLKSEL</name>
              <description>PCNT0 Clock Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCTRL</name>
          <description>ADC Control Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000133</resetMask>
          <fields>
            <field>
              <name>ADC0CLKDIV</name>
              <description>ADC0 Clock Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODIVISION</name>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0CLKSEL</name>
              <description>ADC0 Clock Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>ADC0 is not clocked</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCO</name>
                  <description>AUXHFRCO is clocking ADC0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking ADC0</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFSRCCLK</name>
                  <description>HFSRCCLK is clocking ADC0</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0CLKINV</name>
              <description>Invert Clock Selected By ADC0CLKSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTEPEN</name>
          <description>I/O Routing Pin Enable Register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x10000007</resetMask>
          <fields>
            <field>
              <name>CLKOUT0PEN</name>
              <description>CLKOUT0 Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKOUT1PEN</name>
              <description>CLKOUT1 Pin Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKOUT2PEN</name>
              <description>CLKOUT2 Pin Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKIN0PEN</name>
              <description>CLKIN0 Pin Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTELOC0</name>
          <description>I/O Routing Location Register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F3F3F</resetMask>
          <fields>
            <field>
              <name>CLKOUT0LOC</name>
              <description>I/O Location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT1LOC</name>
              <description>I/O Location</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT2LOC</name>
              <description>I/O Location</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTELOC1</name>
          <description>I/O Routing Location Register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CLKIN0LOC</name>
              <description>I/O Location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC6</name>
                  <description>Location 6</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC7</name>
                  <description>Location 7</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Configuration Lock Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFRCOSS</name>
          <description>HFRCO Spread Spectrum Register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F07</resetMask>
          <fields>
            <field>
              <name>SSAMP</name>
              <description>Spread Spectrum Amplitude</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSINV</name>
              <description>Spread Spectrum Update Interval</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
